class calculatecar:
    def carnumber(number):
        numset = list(number)
        cal_1 = int(numset[0])+int(numset[1])+int(numset[2])+int(numset[3])
        cal_3 = str(cal_1)
        if len(cal_3) == 1:
            cal_2 = int(cal_3)
        elif len(cal_3) != 1:
            cal_2 = int(cal_3[0])+int(cal_3[1])
        if cal_2 == 1:
            mes = "เหมาะสำหรับคนมียศมีตำแหน่ง ข้าราชการ ผู้มีอำนาจวาสนา"
        elif cal_2 == 2:
            mes = "เหมาะกับผู้หญิง คนทำงานด้านบริการ การเงิน การค้าขาย ช่วยส่งเสริมด้านการเงิน"
        elif cal_2 == 3:
            mes = "เหมาะสำหรับผู้ชาย คนทำงานในเครื่องแบบ"
        elif cal_2 == 4:
            mes = "เหมาะสำหรับคนที่ทำงานด้านเจรจา การติดต่อสื่อสาร"
        elif cal_2 == 5:
            mes = "เหมาะสำหรับทุกคนและคนที่ทำงานด้านการศึกษา คนที่มีความน่าเชื่อถือ"
        elif cal_2 == 6:
            mes = "เหมาะสำหรับคนทำงานด้านการบันเทิง เสริมสวย ขายของสวยงาม"
        elif cal_2 == 7:
            mes = "เหมาะสำหรับคนที่ทำอาชีพด้านเกษตรกรรม แต่มันจะเกิดผลเสียด้านการเงิน อุบัติเหตุบ่อย"
        elif cal_2 == 8:
            mes = "เหมาะสำหรับคนทำงานกลางคืน อาชีพเสี่ยงอันตราย อาชีพสีเทา"
        else:
            mes = "เหมาะสำหรับทุกคน สิ่งศักดิ์สิทธิ์คุ้มครอง แคล้วคลาดปลอดภัย"
        num_1 = numset[0]+numset[1]
        num_2 = numset[2]+numset[3]
        positive = ('15' , '51', '22', '23', '32', '24', '42', '26', '62', '28', '82', '29', '92', '35', '53', '36', '63', '45', '54', '49', '94', '55', '89', '98', '95', '59', '99')
        list_pos = list(positive)
        negative = ('01', '10', '02', '20', '30', '03', '13', '31', '12', '21', '17', '71', '37', '73', '38', '83', '33', '60', '06', '67', '76', '11', '19', '91', '77', '93', '39', '35', '53', '36', '63', '11', '19', '91')
        list_neg = list(negative)
        if num_1 in list_pos:
            num_3 = 1
        elif num_1 in list_neg:
            num_3 = 0
        else:
            num_3 = 0.5
        if num_2 in list_pos:
            num_4 = 1
        elif num_2 in list_neg:
            num_4 = 0
        else:
            num_4 = 0.5
        weight = (((int(num_3)+int(num_4))/2)*100)
        inweight = 100 - (((int(num_3)+int(num_4))/2)*100)
        return mes, weight, inweight